[{
    "Title":"Today's Quiz",
    "Response":"Hoy vamos a hacer un quiz sobre react y useState!",
    
    "Image":"https://www.show.news/__export/1567201752167/sites/debate/img/2019/08/30/gato_png_crop1567201738546.jpg_1902800913.jpg"
},
{
    "Title":"Cómo se define un nuevo componente en React?",
    "Response":" Hay varias formas de hacerlo pero lo primero que hay que hacer es un archivo js con el nombre del componente, de manera que se trabaje ordenadamente. Lo siguiente a hacer es crear un componente en una constante y eso lo que hace es asignar a una constante JSX. La otra forma es mediante el uso de funciones en la que retornamos JSX. En este código yo he usado una función: ",
    "Image":"https://github.com/Paolaaaaaa/silver-umbrella/blob/main/IMG_quiz_react/primera_pregunta.PNG?raw=true"
},{
    "Title":"Cómo se define un nuevo estado?",
    "Response":"Primero se importa 'useState' de 'react', para que dentro de la función en la que se a crado un componente se llama a la función con el valor inicial que va a tomar la variable a la que vamos cambiar de estado en ejeción. Así mismo se decontruye el retorno de esa función a la misma variable, y una función que permita manipular el cambio. A continuación un ejemplo de como se ve esto en código: ",
    "Image":""
},{
    "Title":"F o V ... El inicializador del estado puede ser una función.",
    "Response":"Verdadero, siempre y cuando la función retorne un valor valido que permita inicializar una variable.",
    "Image":"https://github.com/Paolaaaaaa/silver-umbrella/blob/main/IMG_quiz_react/segunda_pregunta.PNG?raw=true"
},
{
    "Title":"Qué es el virtual DOM",
    "Response":"El virtual DOM es una copia del DOM real, en el que se genera para comparar con el DOM real y saber las secciones exactas a realizar cambios y no tener que renderizar todo componente. A continuación una imagen del DOM de los cambios que se hacen al pasar entre páginas:",
    "Image":"https://github.com/Paolaaaaaa/silver-umbrella/blob/main/IMG_quiz_react/cuarta_pregunta.PNG?raw=true"
}]